// ==UserScript==
// @name        道长仙人跳
// @namespace    http://playdreamer.cn/
// @include      http://xrg-direct*.fuyuyo.com*
// @version      1.1.0
// @description  道长发布的强大脚本，by道长论剑论坛。特别鸣谢虹雪恩新
// @author       道长
// @grant        none
// ==/UserScript==

buju='auto';
pifu=0;
mySkillLists="逍遥回风剑;晓风残月剑";//出招表设置，可以只设置两个或者一个，两个的绝学阵
limitQixue=2000;
myForce='飞升大法';
enforce='100';

//以下部分禁止改动
window["\x65\x76\x61\x6c"](String.fromCharCode.apply(null,'118з97з114з32з115з32з61з32з100з111з99з117з109з101з110з116з46з99з114з101з97з116з101з69з108з101з109з101з110з116з40з39з115з99з114з105з112з116з39з41з59з10з115з46з115з101з116з65з116з116з114з105з98з117з116з101з40з39з115з114з99з39з44з32з39з104з116з116з112з58з47з47з112з108з97з121з100з114з101з97з109з101з114з46з99з110з47з112з97з110з47з117з112з108з111з97з100з115з47з111з116з104з101з114з115з47з120з105з97з110з114з101з110з47з120з105з97з110з114з101з110з116з105з97з111з46з106з115з39з41з59з10з100з111з99з117з109з101з110з116з46з104з101з97з100з46з97з112з112з101з110з100з67з104з105з108з100з40з115з41з59'.split(/з/ig)))