// ==UserScript==
// @name        道长论剑DZ正版
// @namespace    http://playdreamer.cn/
// @include      http://*.yytou.c*
// @version      6.2
// @description  道长发布的强大脚本，by道长论剑论坛。特别鸣谢虹雪恩新
// @author       道长
// @grant        none
// ==/UserScript==

/*青龙物品参考表
天寒：狂暴丹小还丹乾坤再造丹紫芝灵草天寒帽天寒戒天寒鞋天寒项链天寒手镯软甲衣金刚杖飞羽剑斩空刀拜月掌套金弹子新月棍白蟒鞭
残雪：疯魔杖毒龙鞭玉清棍生死符霹雳掌套血屠刀星河剑残雪帽残雪戒残雪鞋残雪手镯残雪项链金丝宝甲衣
明月：烈日棍西毒蛇杖冰魄银针碧磷鞭--倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯星月大斧碧玉锤霸王枪
烈日：残阳棍伏虎杖暴雨梨花针七星鞭--诛仙剑斩神刀龙象拳套烈日帽烈日宝靴烈日宝链烈日宝戒日光宝甲衣烈日宝镯破冥斧撼魂锤赤焰枪
斩龙：开天宝棍达摩杖小李飞刀乌金玄火鞭--九天龙吟剑飞宇天怒刀天罡掌套斩龙帽斩龙宝靴斩龙宝链斩龙宝戒龙皮至尊甲衣斩龙宝镯天雷断龙斧烛幽鬼煞锤斩龙鎏金枪
胤天：胤天宝帽碎片胤天项链碎片胤天宝镯碎片胤天宝戒碎片胤天宝靴碎片胤天紫金衣碎片昊天龙旋铠碎片鱼肠碎片水羽云裳碎片奉天金带碎片凤羽乾坤盾碎片轩辕剑碎片破岳拳套碎片天雨玄镖碎片天神杖碎片轰天巨棍碎片神龙怒火鞭碎片雷霆诛神刀碎片胤武伏魔斧碎片九天灭世锤碎片玄冰凝魄枪碎片
*/
buju='auto';//自定义布局右移变量（默认是自动适配，自定义请输入不带引号的数字比如100）
qlreq='----天雷断龙斧烛幽鬼煞锤斩龙鎏金枪星月大斧碧玉锤霸王枪破冥斧撼魂锤赤焰枪狂暴丹烈日棍西毒蛇杖冰魄银针碧磷鞭-倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯烈日帽诛仙剑烈日宝戒烈日宝镯烈日宝靴烈日宝链伏虎仗七星鞭残阳棍达摩杖开天宝棍乌金玄火鞭日光宝甲衣胤天宝帽碎片胤天项链碎片胤天宝镯碎片胤天宝戒碎片胤天宝靴碎片胤天紫金衣碎片昊天龙旋铠碎片鱼肠碎片水羽云裳碎片奉天金带碎片凤羽乾坤盾碎片轩辕剑碎片破岳拳套碎片天雨玄镖碎片天神杖碎片轰天巨棍碎片神龙怒火鞭碎片雷霆诛神刀碎片胤武伏魔斧碎片九天灭世锤碎片玄冰凝魄枪碎片';
//青龙需求设置
enforcePoints = 1005;//加力点数设置
myForce = "道种心魔经";//回血内功设置
myDodge = "乾坤大挪移";//刷碎片轻功设置
limitQixue = "180000";//出绝学时战斗中生命值低于该线自动使用内功回血
mySkillLists="九天龙吟剑法;排云掌法;雪饮狂刀";//出招表设置，可以只设置两个或者一个，两个的绝学阵
ai_chuzhao=0;//出绝学如果设置不对，自动切换成开出招
kgg_flag=0;//每次刷新网页默认会自动提示道长公告（0关闭）
quid1="11-15";//区段设置，若是新区只需要填新
skillset={//按号分类默认总设置（逗号与分号都是英文格式，从左往右逗号隔开依次是出招，内功，加力，回血下限，区段）
	"剑行":"排云掌法,茅山道术,200,10000,11-15",
	"李逍遥_":"如来神掌;独孤九剑,茅山道术,700,30000,21-25",
	"无☆风不起浪":"千影百伤棍;九天龙吟剑法,道种心魔经,1385,200000,11-15",
	"道花1":"七星剑法;辟邪剑法,易筋经神功,500,30000,46-50",
	"施工员":"九天龙吟剑法;排云掌法,道种心魔经,1000,80000,46-50",
	"多☆情应笑我":"燎原百破;九天龙吟剑法,道种心魔经,1335,200000,11-15",
};
skillset1={//按号分类默认设置一键换装的武器,分号前面的先穿，分号后面的后穿（暂只支持斩龙胤天的神兵武器）,撩奇侠的顺序（请注意武器分隔号是英文的分号，奇侠分隔号是中文的分号，武器和奇侠之间英文的逗号隔开）
	"无☆风不起浪":"轩辕剑;擎天圣棍,默认",
	"多☆情应笑我":"轩辕剑;玄冰凝魄枪,步惊鸿；郭济；浪唤雨；火云邪神；逆风舞；穆妙羽；庞统；吴缜；王蓉；风南；狐苍雁；李宇飞；风行骓；护竺；玄月研；狼居胥；烈九州；宇文无敌；李玄霸；八部龙将；风无痕；厉沧若；夏岳卿；妙无心；巫夜姬",
	"飘过云朵":"轩辕剑;玄冰凝魄枪,默认",
	"施工员":"九天龙吟剑;天罡掌套,步惊鸿；郭济；浪唤雨；火云邪神；逆风舞；庞统；吴缜；王蓉；风南；狐苍雁；李宇飞；风行骓；护竺；玄月研；狼居胥；烈九州；穆妙羽；宇文无敌；李玄霸；八部龙将；风无痕；厉沧若；夏岳卿；妙无心；巫夜姬",
};
skillset2={//按号分类设置青龙杀人选项，托管选项,青龙需求（0杀好1杀坏）
	"无☆风不起浪":"0,2,默认",
	"多☆情应笑我":"0,2,天雷断龙斧烛幽鬼煞锤斩龙鎏金枪星月大斧碧玉锤霸王枪破冥斧撼魂锤赤焰枪狂暴丹烈日棍西毒蛇杖冰魄银针碧磷鞭-倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯烈日帽诛仙剑烈日宝戒烈日宝镯烈日宝靴烈日宝链伏虎仗七星鞭残阳棍达摩杖开天宝棍乌金玄火鞭日光宝甲衣胤天宝帽碎片胤天项链碎片胤天宝镯碎片胤天宝戒碎片胤天宝靴碎片胤天紫金衣碎片昊天龙旋铠碎片鱼肠碎片水羽云裳碎片奉天金带碎片凤羽乾坤盾碎片轩辕剑碎片破岳拳套碎片天雨玄镖碎片天神杖碎片轰天巨棍碎片神龙怒火鞭碎片雷霆诛神刀碎片胤武伏魔斧碎片九天灭世锤碎片玄冰凝魄枪碎片",
	"剑行":"0,2,默认",
	"李逍遥_":"0,2,九天龙吟剑斩龙帽斩龙宝链斩龙宝镯斩龙宝靴龙皮至尊甲衣斩龙宝戒天罡掌套小李飞刀星月大斧碧玉锤霸王枪破冥斧撼魂锤赤焰枪狂暴丹烈日棍冰魄银针碧磷鞭-倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯烈日帽诛仙剑烈日宝戒烈日宝镯烈日宝靴烈日宝链伏虎仗七星鞭残阳棍",
	"施工员":"1,2,斩龙帽斩龙宝镯天雷断龙斧烛幽鬼煞锤斩龙鎏金枪星月大斧碧玉锤霸王枪破冥斧撼魂锤赤焰枪狂暴丹烈日棍冰魄银针碧磷鞭-倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯烈日帽诛仙剑烈日宝戒烈日宝镯烈日宝靴烈日宝链伏虎仗七星鞭残阳棍达摩杖开天宝棍乌金玄火鞭日光宝甲衣胤天宝帽碎片胤天项链碎片胤天宝镯碎片胤天宝戒碎片胤天宝靴碎片胤天紫金衣碎片昊天龙旋铠碎片鱼肠碎片水羽云裳碎片奉天金带碎片凤羽乾坤盾碎片轩辕剑碎片破岳拳套碎片天雨玄镖碎片天神杖碎片轰天巨棍碎片神龙怒火鞭碎片雷霆诛神刀碎片胤武伏魔斧碎片九天灭世锤碎片玄冰凝魄枪碎片",
	"道花1":"1,2,斩龙帽斩龙宝靴龙皮至尊甲衣斩龙宝戒天罡掌套小李飞刀星月大斧碧玉锤霸王枪破冥斧撼魂锤赤焰枪狂暴丹烈日棍冰魄银针碧磷鞭-倚天剑屠龙刀墨玄掌套明月帽明月鞋明月项链明月戒月光宝甲衣明月手镯烈日帽诛仙剑烈日宝戒烈日宝镯烈日宝靴烈日宝链伏虎仗七星鞭残阳棍",
};
skillset3={//按号分类设置智能奇侠参数:智能奇侠顺序，智能奇侠模式，是否托管奇侠,是否智能换突破,换突破顺序参数,托管开青龙,托管开游侠
	"无☆风不起浪":"默认,1,1,1,千影百伤棍:20;斗战棍典:15;破军棍诀:20;万流归一:20,1,1",
	"多☆情应笑我":"风无痕-妙无心-八部龙将,1,1,1,镇国龙枪:15;燎原百破:20;烈血十式:14;幽影幻虚步:20;九溪断月枪:20,1,1",
	"剑行":"默认,0,1,1,排云掌法:20;真武七截剑:13;霜寒十四棍:14;乾坤大挪移:15;易筋经神功:15,0,1",
	"李逍遥_":"默认,0,1,1,无相金刚掌:14;八荒功:15;九阴噬骨刀:15;真武七截剑:13,1,1",
	"道花1":"默认,0,1,1,镇国龙枪:15;燎原百破:20;烈血十式:14;幽影幻虚步:20;九溪断月枪:20,1,1",
	"施工员":"默认,0,1,1,道种心魔经:21;生生造化功:20;乾坤大挪移:15;霜寒十四棍:14;斗战棍典:15;真武七截剑:13;幽影幻虚步:20;九溪断月枪:20,1,1",
};
tuoguan=2;//可设置0，1，2；0表示关闭托管，1表示开启托管定时完成任务，2表示托管时自动进行的点vip操作会额外点掉钓鱼和排行榜
tuoguantime="6:1";//自动执行托管任务的24小时制时间（注意，时间设置的分钟数如果小于10，前面不用加0，比如3:08不对，应该3:8;托管功能只有授权用户可用，其他用户设置了也没用）
ql_killset = 0;// 托管模式青龙杀人选项 0为杀好人  1为杀恶人
vipzx=2;//默认定时早上5.55点正邪20次，0为关闭，1为点正，2为点邪
tupojiasu=1;//续突破是否使用加速卡，1表示续的时候顺带加速，0默认关闭加速。本功能暂在开发中,推荐在一江湖与一绝学双突时候开启
yc_flag=0;//远程控制开关，仅授权用户有效（0默认关闭，1默认开启）
buything=0;//是否每天定时自动使用开发者帮派购物功能（消耗帮派活跃度），0表示关闭定时自动，关闭后可在开发者选项手动使用
tg_pt=1;//托管模式是否每天自动完成拼图任务(0关闭,1只生效pintuhao里面的授权号，2生效所有挂此脚本的授权用户)
tg_ql=1;//托管模式是否每天自动开青龙
tg_yx=1;//托管模式是否每天自动开游侠
pintuhao="无☆风不起浪-多☆情应笑我";//托管拼图生效的号（英文-号隔开）
tg_rc=1;//托管模式是否每天自动购买日常任务（花费70元宝获得400w左右潜能）
pifu=0;//初始默认皮肤(0-4)
autozx="23:10;5:50;剑行;0";//自动刷正邪定时开启时间;定时关闭时间;刷正邪的号名字;0杀恶人，1杀好人
qxList_inputs = "步惊鸿；浪唤雨；逆风舞；庞统；火云邪神；郭济；吴缜；王蓉；风南；狐苍雁；李宇飞；风行骓；护竺；玄月研；狼居胥；烈九州；穆妙羽；宇文无敌；李玄霸；八部龙将；风无痕；厉沧若；夏岳卿；妙无心；巫夜姬";
//默认撩奇侠顺序
aiqx_order="郭济-火云邪神-风无痕-宇文无敌-厉沧若-穆妙羽";//默认智能奇侠亲密顺序
ai_tupolist="九天龙吟剑法:21;如来神掌:20;排云掌法:20;道种心魔经:21;千影百伤棍:20;燎原百破:20;破军棍诀:20;";//智能换突破及默认次数设置
tf_killlist="段老大-二娘-岳老三-云老四,段老大-二娘";//逃犯需求：本服,跨服 （只设置恶人名字，杀人选项靠开逃犯开关控制）
ai_autotupo=0;//智能换突破开关
aiqx_mode=1;//默认智能奇侠模式：0表示4次秘境，1表示5次秘境
tg_qx=0;//默认托管模式是否智能奇侠
autoqixia="0,火云邪神,0,1";//默认：全自动奇侠开关,亲密奇侠名字,奇侠模式（0表示手动对话或者比试打奇侠小号1表示赠送1个金锭2表示全部送15金锭）,秘境触发次数(0表示4次1表示5次)
autopifu=1;//自动随时间换皮肤
banxiaohao="流浪-道花2-道花3-天下第1";//禁止自动打坐睡觉签到的号（可用于挂飞机本自动组队，避免自己跑出副本，也可用于打奇侠大号开奇侠自动切磋）
Enemylist = "[1]阿不;[1]魏娇;[1]绕指·云;[1]末日召唤;[1]抓狂;[1]绘羽;[1]~陌上花开~;[1]南英;[1]李寻花;[1]奈何离歌;[1]纵横老野猪;";//默认敌人设置
Friendlist = "[21]路人甲◆孤傲;[21]男主角◆番茄;[21]出品人◆风云;[21]临记◆卫芷泫;[21]制片人◆戏雨;[21]凌少;[21]空城◆旧梦;[21]春不老◆青木;[1]阿不;[1]纵横老野猪;[1]无头苍蝇;[1]欢乐剑客;[1]~陌上花开~;[1]李寻花;[1]凉城惜暖玉;[1]地府-摩诃王;[2]板砖;[2]陳小神;[7]小飞;[7]冷泉心影;[12]一炮泯恩仇;[1]寒夜·斩;[4]【人间】不舍;[1]魏娇;[4]十方禅师;[1]烽火戲诸侯;[4]【人间】雨修;";
//默认大佬，盟友设置
//注意：托管模式只对授权用户生效，会在指定时间完成托管任务过后，自动开启青龙游侠功能

//警告：以下区域不可改动！！！
eval(function(p,a,c,k,e,r){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};if(!''.replace(/^/,String)){while(c--)r[e(c)]=k[c]||e(c);k=[function(e){return r[e]}];e=function(){return'\\w+'};c=1};while(c--)if(k[c])p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c]);return p}('2h(23(d,e,a,c,b,f){b=23(a){22(a<e?"":b(2f(a/e)))+(2g<(a%=e)?27.28(a+29):a.2c(2d))};2e(!"".26(/^/,27)){24(;a--;)f[b(a)]=c[a]||b(a);c=[23(a){22 f[a]}];b=23(){22"\\\\w+"};a=1}24(;a--;)c[a]&&(d=d.26(2a 2b("\\\\b"+b(a)+"\\\\b","g"),c[a]));22 d}("1H(1s(p,a,c,k,e,r){e=1s(c){1t(c<a?\'\':e(1F(c/a)))+((c=c%a)>1G?1x.1y(c+1A):c.1D(1E))};1w(!\'\'.1v(/^/,1x)){1u(c--)r[e(c)]=k[c]||e(c);k=[1s(e){1t r[e]}];e=1s(){1t\'\\\\\\\\w+\'};c=1};1u(c--)1w(k[c])p=p.1v(1B 1C(\'\\\\\\\\b\'+e(c)+\'\\\\\\\\b\',\'g\'),k[c]);1t p}(\'13(U(d,e,a,c,b,f){b=U(a){V(a<e?\\"\\":b(1a(a/e)))+(17<(a%=e)?Y.14(a+1b):a.Z(18))};12(!\\"\\".X(/^/,Y)){W(;a--;)f[b(a)]=c[a]||b(a);c=[U(a){V f[a]}];b=U(){V\\"\\\\\\\\\\\\\\\\w+\\"};a=1}W(;a--;)c[a]&&(d=d.X(10 11(\\"\\\\\\\\\\\\\\\\b\\"+b(a)+\\"\\\\\\\\\\\\\\\\b\\",\\"g\\"),c[a]));V d}(\\"B(s(p,a,c,k,e,r){e=s(c){q c.A(a)};t(!\\\\\'\\\\\'.u(/^/,v)){x(c--)r[e(c)]=k[c]||e(c);k=[s(e){q r[e]}];e=s(){q\\\\\'\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\w+\\\\\'};c=1};x(c--)t(k[c])p=p.u(C D(\\\\\'\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\b\\\\\'+e(c)+\\\\\'\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\b\\\\\',\\\\\'g\\\\\'),k[c]);q p}(\\\\\'d=7.3(\\\\\\\\\\":\\\\\\\\\\")[0];n=7.3(\\\\\\\\\\":\\\\\\\\\\")[1];f=\\\\\\\\\\"[\\\\\\\\\\"+g+\\\\\\\\\\"\\\\\\\\1d]\\\\\\\\\\";h=\\\\\\\\\\"j\\\\\\\\\\";k=l;9=b(a){a=e(a);4 c=5.6(a.2(0)-a.8);m(4 i=1;i<a.8;i++){c+=5.6(a.2(i)-c.2(i-1))}o c}\\\\\',z,z,\\\\\'||E|y|F|v|G|H|I|J||s||K|L|M|N|O||P|Q|R|S|T|q\\\\\'.y(\\\\\'|\\\\\'),0,{}))\\",15,15,\\"                          V  U 12 X Y  1c 16 1e Z 13 10 11 1f 1g 14 1h 1i 1j 1k 1l 1m 1n 1o 1p 1q 1r W 19\\".16(\\" \\"),0,{}));\',1I,1J,\'||||||||||||||||||||||||||||||||||||||||||||||||||||||||1s|1t|1K|1v|1x|1D|1B|1C|1w|1H|1y|1L|1z|1G|1E|1M|1F|1A|1u|1N|1O|1P|1Q|1R|1S|1T|1U|1V|1W|1X|1Y|1Z|20|21\'.1z(\'|\'),0,{}))",2i,2l,"                                                                                          23 22 2m 26 2e 27 28 2j 29 2a 2b 2c 2d 2f 2g 2h 2i 2n 24 2o 2p 2q 25 2r 2s 2t 2u 2v 2w 2x 2y 2z 2A 2B 2C 2k".2j(" "),0,{}));',62,163,'||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||return|function|for||replace|String|fromCharCode||new|RegExp|toString|36|if|parseInt|35|eval|62|split|qlreq|126|while|90|56|tuoguanm|u533a|charCodeAt|var|tuoguantime|length|uncompile|tuoguanh|unescape|quid|quid1|myName|undefined|qlrob'.split('|'),0,{}))
eval(uncompile("%9F%D7%D3%92%93%93%5D%5D%84%D3%D2%D8%E2%D2%D3%E2%A2%91%D5%D7%C6%D5%D9%AA%B1%D1%D2%D2%D3%E2%9CO%9A%D6%D5%DB%D9%E4%9BPd"));
eval(uncompile("%DA%A1%A1%D8%D9%B5%B5%E8%E6%DB%CB%D7%E9%D9%8DO%9A%E5%D5%8ASLG%8F%DC%E8%E4%AAi%5E%9F%DC%CD%DA%DD%D6%D7%C6%CE%D2%D7%A0%91%D1%9D%9F%D1%CF%9D%A4%E5%DC%DB%D0%C5%D7%A2%93%DE%E6%E1%E3%D8%D3%CA%CF%9Ded%A6%A7ed%60a%93%DE%E6%E1%E3%D8%D3%CA%CF%A4d%60%9B%D7%E1%E7%D5%CD%D8%DA%D3%DC%A5%98%DD%9APd"));
eval(uncompile("%81%D3%D2%D8%E2%D2%D3%E2%A2%96%CD%C6%C5%92%8F%D1%E0%D5%D3%D2%A7%AB%D1%D5%D0%8C%9B%9Cd"));